# Tutorial SQL

# Introducción a SQL

## ¿Qué es SQL?

SQL (Structured Query Language) es un lenguaje de programación que se utiliza para gestionar y manipular bases de datos relacionales. SQL se utiliza para realizar tareas como la recuperación de datos, la actualización de datos, la eliminación de datos y la creación de tablas y bases de datos.

## ¿Qué hace SQL?

- SQL puede ejecutar consultas en una base de datos
- SQL puede recuperar datos de una base de datos
- SQL puede insertar registros en una base de datos
- SQL puede actualizar registros en una base de datos
- SQL puede eliminar registros de una base de datos
- SQL puede crear nuevas bases de datos
- SQL puede crear nuevas tablas en una base de datos
- SQL puede crear procedimientos almacenados en una base de datos
- SQL puede crear vistas en una base de datos
- SQL puede establecer permisos en tablas, procedimientos y vistas

## Diferentes tipos de SQL

Existen diferentes lenguajes basados en SQL que se utilizan para realizar tareas específicas. Algunos de los más comunes son:

- SQL estándar: Es la base sobre la que se construyen otros dialectos de SQL. Define las reglas básicas para la - manipulación y consulta de datos.
- T-SQL (Transact-SQL): Usado principalmente en Microsoft SQL Server, agrega funcionalidades como programación procedural y manejo de transacciones.
- PL/SQL (Procedural Language/SQL): Lenguaje de procedimientos utilizado en Oracle Database, permite la creación de funciones, procedimientos almacenados y triggers.
- PL/pgSQL: Similar a PL/SQL, pero utilizado en PostgreSQL para mejorar la funcionalidad procedural.
- MySQL SQL: Implementación de SQL utilizada en MySQL, con algunas diferencias en sintaxis y funciones específicas.
- SQLite SQL: Lenguaje SQL utilizado en SQLite, una base de datos ligera y sin servidor, con algunas limitaciones en comparación con otros RDBMS.

## RBDMS (Relational Database Management System)

Un RDBMS es un sistema de gestión de bases de datos que se basa en el modelo relacional. Un RDBMS permite a los usuarios interactuar con la base de datos utilizando SQL. Algunos ejemplos de RDBMS son:

- MySQL: Muy utilizado en desarrollo web, de código abierto y con buen rendimiento.
- PostgreSQL: Base de datos avanzada con fuerte soporte para transacciones y extensibilidad.
- Microsoft SQL Server: Usado en entornos empresariales, con integración en el ecosistema de Microsoft.
- Oracle Database: Potente y utilizado en aplicaciones empresariales de gran escala.
- SQLite: Base de datos ligera y embebida, ideal para aplicaciones móviles y pequeños proyectos.

# Usar sql en Jupyter

1. Instalación de Dependencias  
Antes de empezar, necesitamos instalar algunos paquetes esenciales. Ejecuta estos comandos en la terminal.

```bash
pip install ipykernel ipython-sql sqlite3 prettytable
```

2. Agregamos el directorio de scripts de python a `Path`

3. Cargar la Extensión SQL en Jupyter
Una vez instalado, abre Jupyter y en una celda de codigo carga la extensión SQL con:

```python
%load_ext sql
```
3. Crear la Base de Datos en una Carpeta Específica

Es recomendable mantener las bases de datos organizadas. Creemos una carpeta llamada SQL y guardemos la base de datos ahí.

```python
%sql sqlite:///SQL/mi_base_datos.db
```

3. Crear una Tabla de Ejemplo

Ahora, podemos crear una tabla en nuestra base de datos.                                    

```python
%%sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER
);
```

4. Insertar Datos en la Tabla

```python
%%sql
INSERT INTO personas (nombre, edad) VALUES ('Juan', 25);
INSERT INTO personas (nombre, edad) VALUES ('Maria', 30);
```

5. Consultar Datos de la Tabla

```python
%%sql
SELECT * FROM personas;
```

Utilizamos `%sql` cuando queremos ejecutar una sola instrucción SQL y `%%sql` cuando queremos ejecutar varias instrucciones SQL.

Durante el desarrollo se va a usar sqlite debido a que es la mas facil de usar en Jupyter, pero se puede cambiar a cualquier otra base de datos relacional.

In [ ]:
%load_ext sql
%sql sqlite:///SQL/mi_base_datos.db

In [ ]:
import prettytable
prettytable.__dict__["DEFAULT"] = "DEFAULT"

In [ ]:
%%sql
select * from personas;

# Conceptos Básicos de SQL

### Sintaxis básica de SQL

Las palabras clave y comandos SQL son faciles de aprender(lenguaje de alto nivel).

Las palabras clave SQL NO distinguen entre mayúsculas y minúsculas:`SELECT` es lo mismo que `select`.

Algunos sistemas de bases de datos requieren un punto y coma al final de cada instrucción SQL.

El punto y coma es la forma estándar de separar cada instrucción SQL en la base de datos sistemas que permiten ejecutar más de una sentencia SQL en la misma llamada al servidor.

Comandos mas comunes e importantes:

- `SELECT`: Extrae datos de una base de datos.
- `UPDATE`: Actualiza datos en una base de datos.
- `DELETE`: Elimina datos de una base de datos.
- `INSERT INTO`: Inserta nuevos datos en una base de datos.
- `CREATE DATABASE`: Crea una nueva base de datos.
- `ALTER DATABASE`: Modifica una base de datos.
- `CREATE TABLE`: Crea una nueva tabla.
- `ALTER TABLE`: Modifica una tabla.
- `DROP TABLE`: Elimina una tabla.
- `CREATE INDEX`: Crea un índice (clave de búsqueda).
- `DROP INDEX`: Elimina un índice.

## Comandos de base de datos

### `CREATE DATABASE`

El comando `CREATE DATABASE` se utiliza para crear una nueva base de datos en un sistema de gestión de bases de datos relacional (RDBMS).

```sql
CREATE DATABASE mi_base_datos;
```

Como estamos desde Jupyter, usamos el siguiente comando:

In [ ]:
%sql sqlite:///SQL/prueba.db

### `DROP DATABASE`

El comando `DROP DATABASE` se utiliza para eliminar una base de datos existente en un sistema de gestión de bases de datos relacional (RDBMS).

```sql
DROP DATABASE mi_base_datos;
```

Para jupyter debemos cerrar la conexion y luego eliminar el archivo.

Podemos cerrar la conexión con el siguiente comando:

In [ ]:
%sql -d sqlite:///SQL/prueba.db

## Comandos de tablas

### `CREATE TABLE`

El comando `CREATE TABLE` se utiliza para crear una nueva tabla en una base de datos.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER
);
```

Ejemplo:

In [ ]:
%%sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER
);

#### Crear una tabla apartir de otra tabla

```sql 
CREATE TABLE nueva_tabla AS
SELECT columna1, columna2
FROM tabla_existente
WHERE condicion;
```

El where es opcional.

Ejemplo:

In [ ]:
%%sql
CREATE TABLE personas2 AS 
SELECT id , nombre, edad FROM personas;

### `DROP TABLE`

El comando `DROP TABLE` se utiliza para eliminar una tabla existente en una base de datos.

```sql
DROP TABLE personas;
```

Ejemplo:

In [ ]:
%%sql
DROP TABLE personas2;

### `TRUNCATE TABLE`

El comando `TRUNCATE TABLE` se utiliza para eliminar todos los registros de una tabla, pero no elimina la tabla en sí.
No esta disponible en sqlite, pero se puede usar `DELETE FROM tabla;`

```sql
TRUNCATE TABLE tabla;
```

```sql
DELETE FROM tabla;
```

Ejemplo:

In [ ]:
%%sql
DELETE FROM personas2;

### `ALTER TABLE`

El comando `ALTER TABLE` se utiliza para agregar, modificar o eliminar columnas en una tabla existente.

```sql
ALTER TABLE personas
ADD COLUMN ciudad TEXT;
DROP COLUMN ciudad;
RENAME COLUMN ciudad TO ciudad_nueva;
ALTER COLUMN ciudad_nueva TYPE VARCHAR(50);
```

En sqlite no podemos cambiar el tipo de columna, pero si podemos agregar columnas, eliminar columnas y renombrar columnas.

Ejemplo:

In [ ]:
%%sql
-- Creanis una columna "edad2" en la tabla personas2
ALTER TABLE personas2 ADD COLUMN edad2 INTEGER;
SElECT * FROM personas2;

In [ ]:
%%sql
-- La renombran a "edad3"
ALTER TABLE personas2 RENAME COLUMN edad2 TO edad3;
SELECT * FROM personas2;

In [ ]:
%%sql
-- Eliminan la columna "edad3"
ALTER TABLE personas2 DROP COLUMN edad3;
SELECT * FROM personas2;

### Restricciones de tabla

Las restricciones de tabla se utilizan para especificar reglas para los datos en una tabla.
Se puede implementar tanto en la creación de la tabla `CREATE TABLE` como en la modificación de la tabla `ALTER TABLE`.

- `NOT NULL`: Asegura que un campo no pueda tener un valor NULL.
- `UNIQUE`: Asegura que todos los valores en una columna sean diferentes.
- `PRIMARY KEY`: Identifica de forma única cada registro en una tabla.
- `FOREIGN KEY`: Un campo en una tabla que se refiere a la clave principal en otra tabla.
- `CHECK`: Asegura que todos los valores en una columna cumplan una condición específica.
- `DEFAULT`: Inserta un valor predeterminado cuando no se proporciona un valor.
- `INDEX`: Se utiliza para crear y recuperar datos de una tabla de manera más rápida.

#### `NOT NULL`

`NOT NULL` se utiliza para asegurarse de que un campo no pueda tener un valor NULL.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT NOT NULL,
    edad INTEGER NOT NULL
);
```

#### `UNIQUE`

`UNIQUE` se utiliza para asegurarse de que todos los valores en una columna sean diferentes.	

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT UNIQUE,
    edad INTEGER
);
```

#### `PRIMARY KEY`

`PRIMARY KEY` se utiliza para identificar de forma única cada registro en una tabla.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER
);
```

#### `FOREIGN KEY`

`FOREIGN KEY` se utiliza para definir una clave externa en una tabla.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    ciudad_id INTEGER,
    FOREIGN KEY (ciudad_id) REFERENCES ciudades(id)
);
```

#### `CHECK`

`CHECK` se utiliza para asegurarse de que todos los valores en una columna cumplan una condición específica.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER CHECK(edad >= 18)
);
```

#### `DEFAULT`

`DEFAULT` se utiliza para insertar un valor predeterminado cuando no se proporciona un valor.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER DEFAULT 18
);
```

#### `INDEX`

`INDEX` se utiliza para crear y recuperar datos de una tabla de manera más rápida.

```sql
CREATE INDEX idx_nombre ON personas (nombre);
```

#### `AUTOINCREMENT`

`AUTOINCREMENT` se utiliza para generar un número único para cada fila de una tabla.

```sql
CREATE TABLE personas (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nombre TEXT,
    edad INTEGER
);
```

## Manipulación de datos

### `INSERT INTO`

El comando `INSERT INTO` se utiliza para insertar nuevos registros en una tabla existente. La sintaxis básica es la siguiente:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);

Ejemplo:

In [ ]:
%%sql
-- Insertamos los valoes en la tabla personas
INSERT INTO personas (nombre, edad)
VALUES ( 'Juan', 25), ('Maria', 30), ('Pedro', 25), ('Ana', 20);
SELECT * FROM personas;

### `UPDATE`

La instrucción `UPDATE` se utiliza para modificar los registros existentes en una tabla.

```sql
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Actualizamos el nombre de Juan a Juan Perez
UPDATE personas
SET nombre = 'Juan Perez'
WHERE nombre = 'Juan';
SELECT * FROM personas;

### `DELETE`

La instrucción `DELETE` se utiliza para eliminar registros de una tabla.

```sql
DELETE FROM table_name
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Eliminamos a Ana de la tabla personas
DELETE FROM personas
WHERE nombre = "Ana";
SELECT * FROM personas;

### `SELECT`

La instrucción `SELECT` se utiliza para seleccionar datos de una base de datos. Los datos devueltos se almacenan en un resultado de tabla, llamado conjunto de resultados.

```sql
SELECT column1, column2, ...
FROM table_name;
```

El asterisco (`*`) selecciona todas las columnas de una tabla.

Ejemplo:

In [ ]:
%%sql
SELECT nombre, edad FROM personas;

#### `SELECT DISTINCT`

La instrucción `SELECT DISTINCT` se utiliza para devolver solo valores distintos (diferentes).

```sql
SELECT DISTINCT column1, column2, ...
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
SELECT DISTINCT edad FROM personas;

`COUNT(DISTINCT)`: Devuelve el número de valores distintos.

```sql
SELECT COUNT(DISTINCT column1, column2, ...)
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
SELECT COUNT(DISTINCT edad) FROM personas;

### SQL `TOP`, `LIMIT`, `FETCH FIRST` or `ROWNUM` Clause

La cláusula `TOP` se utiliza para especificar el número de registros que se deben devolver.

```sql
SELECT TOP number column1, column2, ...
FROM table_name;
```

En MySQL, se utiliza la cláusula `LIMIT` para limitar el número de registros devueltos.

```sql
SELECT column1, column2, ...
FROM table_name
LIMIT number;
```

En Oracle, se utiliza la cláusula `FETCH FIRST` para limitar el número de registros devueltos.

```sql
SELECT column1, column2, ...
FROM table_name
FETCH FIRST number ROWS ONLY;
```

En SQL Server, se utiliza la cláusula `ROWNUM` para limitar el número de registros devueltos.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE ROWNUM <= number;
```

In [ ]:
%%sql
-- Seleccionamos los 2 primeros registros de la tabla personas
SELECT TOP 2 * FROM personas;

### `ORDER BY`

La cláusula `ORDER BY` se utiliza para ordenar los resultados.

```sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
```

Ejemplo:

In [ ]:
%%sql
/* Ordenamos la tabla por edades de forma descendente,
y por nombre de forma ascendente 
es decir que en un principio se organizara de forma descendente
por edad y si hay empate se organizara de forma ascendente por nombre */
SELECT * FROM personas ORDER BY edad DESC, nombre ASC;

### `WHERE`

La cláusula `WHERE` se utiliza para filtrar registros.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos las personas que tengan una edad mayor o igual a 30
SELECT nombre, edad FROM personas WHERE edad >= 30;

Operadores de comparación comunes:

| Operador  | Descripción                              | Ejemplo                      |
|-----------|------------------------------------------|------------------------------|
| `=`         | Igual                                   | `WHERE edad = 25`            |
| `>`         | Mayor que                              | `WHERE salario > 3000`       |
| `<`         | Menor que                              | `WHERE puntos < 50`         |
| `>=`        | Mayor o igual que                      | `WHERE edad >= 18`           |
| `<=`        | Menor o igual que                      | `WHERE precio <= 1000`       |
| `<>`        | Distinto (en algunas versiones también `!=`) | `WHERE nombre <> 'Juan'` |
| `BETWEEN`   | Entre un rango determinado             | `WHERE edad BETWEEN 18 AND 30` |
| `LIKE`      | Buscar un patrón                       | `WHERE nombre LIKE 'J%'`     |
| `IN`        | Especificar múltiples valores posibles | `WHERE ciudad IN ('Madrid', 'París', 'Londres')` |

Se tienen que usar comillas simples para valores de tipo texto.

#### `AND`, `OR`, `NOT`

Los operadores lógicos `AND`, `OR` y `NOT` se utilizan para combinar condiciones.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND condition2;
```

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition1 OR condition2;
```

```sql
SELECT column1, column2, ...
FROM table_name
WHERE NOT condition;
```

Ejemplo:

In [ ]:
%%sql
/*
Filtra los registros donde:
1. La edad es 25 Y el nombre empieza con 'J' o 'P'
OR
2. El nombre NO está en ('Juan', 'Pedro') Y la edad NO está entre 25 y 29
*/
SELECT *
FROM personas
WHERE edad = 25 AND (nombre LIKE 'J%' OR nombre LIKE 'P%') 
OR nombre NOT IN ('Juan', 'Pedro') AND edad NOT BETWEEN 25 AND 29;

`LIKE` se utiliza en una cláusula `WHERE` para buscar un patrón específico en una columna.
El comodín `%` se utiliza para representar cero, uno o varios caracteres.	

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN LIKE pattern;
```

#### `LIKE`

`LIKE` se utiliza en una cláusula `WHERE` para buscar un patrón específico en una columna.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN LIKE pattern;
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos las personas que tengan el nombre Juan Perez
SELECT * 
FROM personas
WHERE nombre LIKE 'Juan Perez';

#### Comodines de `LIKE`

Los comodines se utilizan con el operador `LIKE` para buscar un patrón específico en una columna.

| Comodín  | Descripción                              | Uso                     |
|----------|------------------------------------------|-------------------------|
| %        | Representa cero, uno o varios caracteres | `WHERE nombre LIKE 'J%'` `WHERE nombre LIKE '%a'` `WHERE nombre LIKE '%or%'` |
| _        | Representa un solo carácter              |`WHERE nombre LIKE 'j__n'` |
| [charlist] | Cualquier carácter en la lista (por ejemplo, `[a-f]`) | `WHERE nombre LIKE '[abc]%'` |
| [^charlist] | Cualquier carácter que no esté en la lista | `WHERE nombre LIKE '[^abc]%'` |
| -        | Rango de caracteres                      | `WHERE nombre LIKE '[a-z]%'` |

#### `IN`

La cláusula `IN` se utiliza para especificar múltiples valores posibles para una columna.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN IN (value1, value2, ...);
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos las personas que esten en la lista(que se llamen Juan Perez o Maria)
SELECT nombre
FROM personas
WHERE nombre IN ('Juan Perez', 'Maria');

#### `IN(SELECT)`

La cláusula `IN` también se puede utilizar con una subconsulta.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN IN (SELECT columnN FROM table_name WHERE condition);
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos las personas que tengan la edad 25
SELECT nombre
FROM personas
WHERE nombre IN (SELECT nombre FROM personas WHERE edad = 25);

#### `BETWEEN`

La cláusula `BETWEEN` se utiliza para seleccionar valores dentro de un rango determinado.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN BETWEEN value1 AND value2;
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos las personas que tengan entre 20 y 30 años
SELECT nombre, edad
FROM personas
WHERE edad BETWEEN 20 AND 30;

In [ ]:
%%sql
-- Seleccionamos las personas las cuales la primer letra de su nombre este entre A y P (excluyen3a la P)
SELECT * FROM personas
WHERE nombre BETWEEN 'A' AND 'P';

#### `EXISTS`

La cláusula `EXISTS` se utiliza para comprobar la existencia de cualquier registro en una subconsulta.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE EXISTS (SELECT columnN FROM table_name WHERE condition);
```

Ejemplo:

In [ ]:
%%sql
-- Selecciona todos los registros de la tabla 'personas2'
-- solo si existe al menos un registro en 'personas' con edad = 32
SELECT * 
FROM personas2
WHERE EXISTS (
    -- Subconsulta: verifica si hay al menos una fila con edad = 32
    -- Como no hay no imprime nada
    SELECT * FROM personas WHERE edad = 32
);

#### `ANY` y `ALL`

Los operadores `ANY` y `ALL` se utilizan con una subconsulta y se utilizan principalmente en combinación con operadores de comparación.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN operator ANY (SELECT columnN FROM table_name WHERE condition);
```

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN operator ALL (SELECT columnN FROM table_name WHERE condition);
```

Ejemplo:


```sql
-- Selecciona todas las filas de 'personas2'
-- donde la edad coincide con al menos un valor en la subconsulta
SELECT * FROM personas2
WHERE edad = ANY (SELECT edad FROM personas WHERE edad = 20);

/*
Salida esperada en SQL estándar:
| id | nombre  | edad |
|----|--------|------|
| 1 | Juan   |  25  |
| 2 | Maria  |  30  |
| 3 | Pedro  |  25  |
| 4 | Ana    |  20  |
Explicación: Se selecciona solo la fila donde 'edad' es 20 en 'personas2',
porque existe al menos un valor de 20 en 'personas'.
*/
```

```sql
-- Selecciona todas las filas de 'personas2'
-- donde la edad es mayor que todas las edades devueltas en la subconsulta
SELECT * FROM personas2
WHERE edad = ALL (SELECT edad FROM personas WHERE edad = 25);

/* Salida esperada en SQL estándar:
| id | nombre  | edad |
|----|--------|------|

No devuelve ninguna fila porque no todas las fila en 'personas' tienen 'edad' = 25.
*/

```

### `AS`

La palabra clave `AS` se utiliza para renombrar una columna o tabla en SQL.

```sql
SELECT column1 AS alias_name
FROM table_name;
```

```sql
SELECT * FROM table_name AS alias_name;
```

Podemos usar comillas("") o corchetes([]) para nombres de columnas o tablas que contengan espacios o caracteres especiales. 

Ejemplo:

In [ ]:
%%sql
SELECT nombre AS Nombre, edad AS Edad
FROM personas;

### `SELECT INTO`

La instrucción `SELECT INTO` se utiliza para copiar datos de una tabla a una nueva tabla.

```sql
SELECT column1, column2, ...
INTO new_table_name [IN externaldatabase]
FROM old_table_name;
```
Sqlite no soporta `SELECT INTO`, pero se puede usar `CREATE TABLE nueva_tabla AS SELECT columna1, columna2 FROM tabla_existente WHERE condicion;`

Ejemplo:

```sql
SELECT nombre AS Nombre, edad AS Edad
INTO personas3
FROM personas2;
```

### `INSERT INTO SELECT`

La instrucción `INSERT INTO SELECT` se utiliza para copiar datos de una tabla a otra.

```sql
INSERT INTO table2 (column1, column2, ...)
SELECT column1, column2, ...
FROM table1;
```

Sqlite no soporta `INSERT INTO SELECT`, pero se puede usar `INSERT INTO nueva_tabla (columna1, columna2) SELECT columna1, columna2 FROM tabla_existente WHERE condicion;`

Ejemplo:

In [ ]:
%%sql
-- Se crea una tabla personas 3 sin valores y se imprime
CREATE TABLE personas3 (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER
);
SELECT * FROM personas3;

In [ ]:
%%sql
-- Se insertan los valores de la tabla personas en la tabla personas3
INSERT INTO personas3 (nombre, edad)
SELECT nombre, edad
FROM personas;
SELECT * FROM personas3;

# Fechas en SQL

## Tipos de datos de fecha y hora

MYSQL:

- `DATE`: Almacena una fecha en formato 'YYYY-MM-DD'.
- `DATETIME`: Almacena una fecha y hora en formato 'YYYY-MM-DD HH:MM:SS'.
- `TIMESTAMP`: Almacena una marca de tiempo en formato 'YYYY-MM-DD HH:MM:SS'.
- `TIME`: Almacena una hora en formato 'HH:MM:SS'.
- `YEAR`: Almacena un año en formato 'YYYY'.

SQL Server:

- `DATE`: Almacena una fecha en formato 'YYYY-MM-DD'.
- `DATETIME`: Almacena una fecha y hora en formato 'YYYY-MM-DD HH:MM:SS'.
- `SMALLDATETIME`: Almacena una fecha y hora en formato 'YYYY-MM-DD HH:MM:SS'.
- `TIMESTAMP`: Almacena una marca de tiempo en formato 'YYYY-MM-DD HH:MM:SS'.

# `CASE`

La expresión `CASE` se utiliza para crear diferentes resultados en una consulta SQL.

```sql
SELECT column1,
    CASE
        WHEN condition1 THEN result1
        WHEN condition2 THEN result2
        ELSE result
    END
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
-- Selecciona nombre, edad y asigna un rango de edad (Joven, Adulto o Anciano)
-- según el valor de edad en la tabla personas2.
SELECT nombre, edad,
    (CASE
        WHEN edad < 25 THEN 'Joven'
        WHEN edad < 35 THEN 'Adulto'
        ELSE 'Anciano'
    END) AS Rango_Edad
FROM personas2;

# Procedimientos almacenados (Funciones)

Un procedimiento almacenado es un conjunto de instrucciones SQL que se almacenan en un sistema de base de datos. Los procedimientos almacenados se pueden reutilizar y compartir en diferentes aplicaciones.

### Crear un procedimiento almacenado

```sql
CREATE PROCEDURE procedure_name
AS
procedure_body
GO;
```

En sqlite se usa:

```sql
CREATE VIEW view_name AS
SELECT column1, column2, ... FROM table_name
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Creamos una funcion llamada personas_vw que muertra la tabla personas
CREATE VIEW personas_vw AS
SELECT * FROM personas;

#### Crear un procedimiento almacenado con parametros

```sql
CREATE PROCEDURE procedure_name
    @parameter1 datatype,
    @parameter2 datatype
AS
procedure_body
GO;
```

En sqlite se usa:

```sql
CREATE VIEW view_name AS
SELECT column1, column2, ... FROM table_name
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Creamos una funcion llamada personas2_mayores_24 que muertra los registros
-- de las personas mayores a 24 años de la tabla personas2
CREATE VIEW personas2_mayores_24 AS
SELECT * FROM personas2
WHERE edad > 24;

### Ejecutar un procedimiento almacenado

```sql
EXEC procedure_name;
```

En sqlite se usa:

```sql
SELECT * FROM view_name;
```

Ejemplo:

In [ ]:
%%sql
-- Se llama la funcion personas_vw
SELECT * FROM personas_vw;

In [ ]:
%%sql
-- Se llama la funcion personas2_mayores_24
SELECT * FROM personas2_mayores_24;

### Eliminar un procedimiento almacenado

```sql
DROP PROCEDURE procedure_name;
```

En sqlite se usa:

```sql
DROP VIEW view_name;
```

Ejemplo:

In [ ]:
%%sql
-- Se elimina la vista personas_vw
DROP VIEW personas_vw;

In [ ]:
%%sql
-- Se confirma que se elimino la vista personas_vw
SELECT * FROM personas_vw;

# `NULL`

`NULL` es un valor especial que indica que un campo de la base de datos está vacío. `NULL` no es lo mismo que un valor cero o una cadena vacía.

Para buscar campos que estén vacíos, se utiliza la cláusula `IS NULL`.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE columnN IS NULL;
```

Ejemplo:

In [ ]:
%%sql
-- Selecciona todas las edades nulas
SELECT nombre, edad
FROM personas
WHERE edad IS NULL;

In [ ]:
%%sql
-- Selecciona todas las edades no nulas
SELECT nombre, edad
FROM personas
WHERE edad IS NOT NULL;

## Funciones NULL

### `IFNULL()`

La función `IFNULL()` se utiliza para reemplazar valores `NULL` por otro valor.

```sql
SELECT column1, IFNULL(column2, 'No disponible') AS alias_name
FROM table_name;
```

Tambien se puede usar `COALESCE()` que es equivalente a `IFNULL()`.

En sqllte usamos `COALESCE()`.

Ejemplo:

In [ ]:
%%sql
-- Se relaciona la tabla consigo misma y se reemplaza los valores NULL de la columna jefe por 'no tiene jefe'
SELECT A.nombre AS empleado, 
       COALESCE(B.nombre, 'no tiene jefe') AS jefe
FROM empleados A
LEFT JOIN empleados B
ON A.id_jefe = B.id_empleado;

# Uniones en SQL

Las uniones en SQL se utilizan para combinar filas de dos o más tablas en función de una relación entre ellas. Las uniones se utilizan para recuperar datos de dos o más tablas relacionadas.

## `INNER JOIN`

La unión interna (`INNER JOIN`) se utiliza para devolver filas cuando hay al menos una coincidencia en ambas tablas.

```sql
SELECT column1, column2, ...
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;
```

Ejemplo:

In [ ]:
%%sql
-- Selecciona todos los datos coincidentes entre las dos tablas (que coincida el nombre)
SELECT personas.nombre, personas.edad
FROM personas 
INNER JOIN personas2
ON personas.nombre = personas2.nombre;

## `LEFT JOIN` o `LEFT OUTER JOIN`

La unión izquierda (`LEFT JOIN`) o unión externa izquierda (`LEFT OUTER JOIN`) se utiliza para devolver todas las filas de la tabla de la izquierda y las filas coincidentes de la tabla de la derecha.

```sql
SELECT column1, column2, ...
FROM table1
LEFT JOIN table2
ON table1.column_name = table2.column_name;
```

Ejemplo:

In [ ]:
%%sql
-- Se crea una tabla compras 
CREATE TABLE compras (
    id_compra INTEGER PRIMARY KEY,
    id_cliente INTEGER,
    producto TEXT
);
SELECT * FROM compras;

In [ ]:
%%sql
-- Se insertan los valores en la tabla compras
INSERT INTO compras (id_compra, id_cliente, producto)
VALUES (100, 1, 'Laptop'), (101, 2, 'Tablet'), (102, 2, 'Smartphone'), (103, 1, 'Smartwatch');
SELECT * FROM compras;

In [ ]:
%%sql
-- Modificamos el nombre de la columna id a id_cliente paraq que coincida con la tabla compras
ALTER TABLE personas2 RENAME COLUMN id TO id_cliente;
SELECT * FROM personas2;

In [ ]:
%%sql
SELECT personas2.nombre, compras.producto
FROM personas2
LEFT JOIN compras
ON personas2.id_cliente = compras.id_cliente;

## `RIGHT JOIN` o `RIGHT OUTER JOIN`

La unión derecha (`RIGHT JOIN`) o unión externa derecha (`RIGHT OUTER JOIN`) se utiliza para devolver todas las filas de la tabla de la derecha y las filas coincidentes de la tabla de la izquierda.

```sql
SELECT column1, column2, ...
FROM table1
RIGHT JOIN table2
ON table1.column_name = table2.column_name;
```

SQlite no soporta `RIGHT JOIN`, pero se puede usar `LEFT JOIN` cambiando el orden de las tablas.

## `FULL JOIN` o `FULL OUTER JOIN`

La unión completa (`FULL JOIN`) o unión externa completa (`FULL OUTER JOIN`) se utiliza para devolver filas cuando hay una coincidencia en una de las tablas.

```sql
SELECT column1, column2, ...
FROM table1
FULL JOIN table2
ON table1.column_name = table2.column_name;
```

Ejemplo:

In [ ]:
%%sql
/*
Devuelve los nombres y edades de ambas tablas, combinando los registros 
cuando el nombre sea el mismo en ambas. Si no hay coincidencia, muestra 
los registros de ambas tablas igualmente.
*/
SELECT personas2.nombre AS nombre_personas2,
personas2.edad AS edad_personas2,
personas.nombre AS nombre_personas,
personas.edad AS edad_personas
FROM personas2
FULL JOIN personas
ON personas2.nombre = personas.nombre;

## Auto Uniones en SQL

Una auto unión es una unión que se realiza en una sola tabla. Se utiliza para combinar filas de la misma tabla.

```sql
SELECT column1, column2, ...
FROM table1 T1, table1 T2
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Se crea una tabla empleados
CREATE TABLE empleados (
    id_empleado INTEGER PRIMARY KEY,
    nombre TEXT,
    id_jefe INTEGER
)
SELECT * FROM empleados;

In [ ]:
%%sql
-- Se insertan los valores en la tabla empleados
INSERT INTO empleados (nombre, id_jefe)
VALUES ('Ana', NULL), ('Juan', 1), ('Pedro', 1), ('Maria', 2);
SELECT * FROM empleados;

In [ ]:
%%sql
-- Se relaciona la tabla consigo misma usando la id de empleado y la id del jefe
SELECT A.nombre AS empleado, B.nombre AS jefe
FROM empleados A , empleados B
WHERE A.id_jefe = B.id_empleado;

In [ ]:
%%sql
-- Se relaciona la tabla consigo misma usando la id de empleado y la id del jefe
-- Devuelve todos los empleados incluido los que no tienen jefes
SELECT A.nombre AS empleado, 
B.nombre AS jefe
FROM empleados A
LEFT JOIN empleados B
ON A.id_jefe = B.id_empleado;

## `UNION`

La cláusula `UNION` se utiliza para combinar el resultado de dos o más instrucciones `SELECT`.

```sql
SELECT column1, column2, ...
FROM table1
WHERE condition
UNION
SELECT column1, column2, ...
FROM table2
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Creamos la tabla medio_tiempo
CREATE TABLE medio_tiempo (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    salario INTEGER
);

-- Creamos la tabla tiempo_completo
CREATE TABLE tiempo_completo (
    id INTEGER PRIMARY KEY,
    nombre TEXT,
    salario INTEGER
);

In [ ]:
%%sql
-- Insertamos los valores en la tabla medio_tiempo
INSERT INTO medio_tiempo (id , nombre, salario)
VALUES (1, 'Juan', 1000), (3, 'Pedro', 1200);
-- Insertamos los valores en la tabla tiempo_completo   
INSERT INTO tiempo_completo (id , nombre, salario)
VALUES (1, 'Juan', 1000), (2, 'Maria', 2000), (4, 'Ana', 1500);

In [ ]:
%%sql
-- Seleccionamos los nombres y salarios de las dos tablas sin duplicados
SELECT nombre, salario
FROM medio_tiempo
UNION
SELECT nombre, salario
FROM tiempo_completo;

In [ ]:
%%sql
-- Seleccionamos los nombres y salarios de las dos tablas con duplicados poruque al agregar
-- la columna tipo las filas ya no son completamente iguales
SELECT nombre, salario, 'medio_tiempo' AS tipo
FROM medio_tiempo
UNION
SELECT nombre, salario, 'tiempo_completo' AS tipo
FROM tiempo_completo;

### `UNION ALL`

La cláusula `UNION ALL` se utiliza para combinar el resultado de dos o más instrucciones `SELECT`, incluyendo duplicados.

```sql
SELECT column1, column2, ...
FROM table1
WHERE condition
UNION ALL
SELECT column1, column2, ...
FROM table2
WHERE condition;
```

Ejemplo:

In [ ]:
%%sql
-- Seleccionamos los nombres y salarios de las dos tablas con duplicados
SELECT nombre, salario
FROM medio_tiempo
UNION ALL
SELECT nombre, salario
FROM tiempo_completo;

# `GROUP BY` en SQL

La cláusula `GROUP BY` se utiliza en conjunto con la instrucción `SELECT` para organizar los resultados en grupos.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition
GROUP BY column1, column2, ...
ORDER BY column1, column2, ...;
```

Ejemplo:

In [ ]:
%%sql
-- Agrupa por edad y cuenta cuántas personas tienen cada edad, 
-- ordenando los resultados de mayor a menor cantidad de personas por edad.
SELECT * FROM personas
GROUP BY edad ;

In [ ]:
%%sql
-- EJemplo con mejor formato
SELECT edad, COUNT(*) AS cantidad
FROM personas
GROUP BY edad
ORDER BY cantidad DESC;

## Funciones de agregado

Generalmente se utilizan en conjunto con la cláusula `GROUP BY` para realizar cálculos en un conjunto de registros.

| Función          | Descripción                                                   | Ejemplo                                      |
|-----------------|---------------------------------------------------------------|----------------------------------------------|
| `COUNT()`       | Cuenta la cantidad de registros en una columna.               | `SELECT COUNT(*) FROM empleados;`           |
| `SUM()`         | Suma todos los valores de una columna numérica.               | `SELECT SUM(salario) FROM empleados;`       |
| `AVG()`         | Calcula el promedio de una columna numérica.                  | `SELECT AVG(edad) FROM empleados;`          |
| `MIN()`         | Devuelve el valor mínimo de una columna.                      | `SELECT MIN(salario) FROM empleados;`       |
| `MAX()`         | Devuelve el valor máximo de una columna.                      | `SELECT MAX(salario) FROM empleados;`       |
| `GROUP_CONCAT()`| Concatena valores de una columna en una sola cadena de texto. *(Solo en MySQL y SQLite)* | `SELECT GROUP_CONCAT(nombre) FROM empleados;` |

En todos los casos podemos utilizar `WHERE` para filtrar los datos, y `AS` para darle un nombre al resultado mejorando la legibilidad.

### `COUNT()`

La función `COUNT()` se utiliza para contar el número de registros en una tabla.

```sql
SELECT COUNT(column_name)
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
-- Imprimme la cantidad de personas en la tabla personas
SELECT COUNT(nombre) AS cantidad_personas FROM personas;

### `SUM()`

La función `SUM()` se utiliza para calcular la suma de los valores de una columna.

```sql
SELECT SUM(column_name)
FROM table_name;
```

Podemos hacer operaciones matemáticas en la función `SUM()`.

Ejemplo:

In [ ]:
%%sql
-- Imprime la suma de las edades de las personas
SELECT SUM(edad) AS suma_edades FROM personas;

### `AVG()`

La función `AVG()` se utiliza para calcular el promedio de los valores de una columna.

```sql
SELECT AVG(column_name)
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
-- Imprime la edad promedio de las personas
SELECT AVG(edad) AS promedio_edades FROM personas;

### `MIN()` y `MAX()`

Las funciones `MIN()` y `MAX()` se utilizan para devolver el valor mínimo y máximo de una columna, respectivamente.

```sql
SELECT MIN(column_name)
FROM table_name;
```

```sql
SELECT MAX(column_name)
FROM table_name;
```

Ejemplo:

In [ ]:
%%sql
-- Imprime la edad maxima de las personas
SELECT MAX(edad) AS maxima_edad FROM personas;

In [ ]:
%%sql
-- Imprime la edad minima de las personas
SELECT MIN(edad) AS minima_edad FROM personas;

### `HAVING` en SQL

La cláusula `HAVING` se utiliza en conjunto con la cláusula `GROUP BY` para filtrar registros agrupados.

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition
GROUP BY column1, column2, ...
HAVING condition;
```

| Caso	| Usa `WHERE`	| Usa  `HAVING` |
|-------|------------|------------|
| Filtrar filas antes de agrupar	|  Sí	|  No |
| Filtrar grupos después de GROUP BY	|  No	|  Sí |
| Funciona sin GROUP BY	|  Sí	|  No |


Ejemplo:

In [ ]:
%%sql
SELECT nombre, edad
FROM personas
GROUP BY edad
HAVING edad > 25;

In [ ]:
%%sql
SELECT nombre, edad
FROM personas
WHERE edad > 2
GROUP BY edad;

# SQL Bases de Datos

## SQL Backup Database for SQL Server

### `BACKUP DATABASE`

La instrucción `BACKUP DATABASE` se utiliza para realizar una copia de seguridad completa de una base de datos.

```sql
BACKUP DATABASE database_name
TO DISK = 'file_path';
```

#### `BACKUP DATABASE` con `WITH DIFFERENTIAL`

Una copia de seguridad diferencial solo realiza una copia de seguridad de las partes de la base de datos que tienen desde la última copia de seguridad completa de la base de datos.

```sql
BACKUP DATABASE database_name
TO DISK = 'file_path'
WITH DIFFERENTIAL;
```

## Tipos de Datos en SQL

### Tipos de datos MySQL

**Tipos de datos de cadena**:

| Data type       | Descripción |
|----------------|------------|
| `CHAR(size)`   | Cadena de longitud fija (puede contener letras, números y caracteres especiales). `size` especifica la longitud en caracteres (0 a 255). Valor predeterminado: 1. |
| `VARCHAR(size)` | Cadena de longitud variable (puede contener letras, números y caracteres especiales). `size` especifica la longitud máxima en caracteres (0 a 65,535). |
| `BINARY(size)`  | Igual a `CHAR()`, pero almacena cadenas de bytes binarias. `size` especifica la longitud en bytes. Valor predeterminado: 1. |
| `VARBINARY(size)` | Igual a `VARCHAR()`, pero almacena cadenas de bytes binarias. `size` especifica la longitud máxima en bytes. |
| `TINYBLOB`     | Para objetos binarios grandes (BLOB). Longitud máxima: 255 bytes. |
| `TINYTEXT`     | Cadena con una longitud máxima de 255 caracteres. |
| `TEXT(size)`   | Cadena con una longitud máxima de 65,535 bytes. |
| `BLOB(size)`   | Para BLOBs. Hasta 65,535 bytes de datos. |
| `MEDIUMTEXT`   | Cadena con una longitud máxima de 16,777,215 caracteres. |
| `MEDIUMBLOB`   | BLOB de hasta 16,777,215 bytes. |
| `LONGTEXT`     | Cadena con una longitud máxima de 4,294,967,295 caracteres. |
| `LONGBLOB`     | BLOB de hasta 4,294,967,295 bytes. |
| `ENUM(val1, val2, ...)` | Objeto de cadena con un solo valor de una lista dada (hasta 65,535 valores). Si se inserta un valor no válido, se guarda como un valor en blanco. |
| `SET(val1, val2, ...)` | Objeto de cadena que puede tener 0 o más valores de una lista dada (hasta 64 valores). |

**Tipos de datos numéricos**:

| Data type       | Descripción |
|----------------|------------|
| `BIT(size)`    | Tipo de valor binario. `size` indica el número de bits por valor (1 a 64). Valor predeterminado: 1. |
| `TINYINT(size)` | Entero muy pequeño. Rango firmado: -128 a 127. Rango sin signo: 0 a 255. |
| `BOOL` / `BOOLEAN` | `BOOL` es un alias de `TINYINT(1)`. Cero es `FALSE`, cualquier otro valor es `TRUE`. |
| `SMALLINT(size)` | Entero pequeño. Rango firmado: -32,768 a 32,767. Rango sin signo: 0 a 65,535. |
| `MEDIUMINT(size)` | Entero mediano. Rango firmado: -8,388,608 a 8,388,607. Rango sin signo: 0 a 16,777,215. |
| `INT(size)` / `INTEGER(size)` | Entero estándar. Rango firmado: -2,147,483,648 a 2,147,483,647. Rango sin signo: 0 a 4,294,967,295. |
| `BIGINT(size)` | Entero grande. Rango firmado: -9,223,372,036,854,775,808 a 9,223,372,036,854,775,807. Rango sin signo: 0 a 18,446,744,073,709,551,615. |
| `FLOAT(size, d)` | Número de punto flotante. `size` es el total de dígitos, `d` es la cantidad de decimales. **(Deprecado en MySQL 8.0.17)**. |
| `FLOAT(p)` | Determina si el tipo es `FLOAT` (`p` de 0 a 24) o `DOUBLE` (`p` de 25 a 53). |
| `DOUBLE(size, d)` / `DOUBLE PRECISION(size, d)` | Número de punto flotante de tamaño normal. `size` es el total de dígitos, `d` es la cantidad de decimales. |
| `DECIMAL(size, d)` / `DEC(size, d)` | Número de punto flotante exacto. `size` es el total de dígitos (máximo 65). `d` es la cantidad de decimales (máximo 30). |

**Tipos de datos de fecha y hora**:

| Data type     | Descripción |
|--------------|------------|
| `DATE`       | Fecha en formato `YYYY-MM-DD`. Rango: `1000-01-01` a `9999-12-31`. |
| `DATETIME(fsp)` | Fecha y hora en formato `YYYY-MM-DD hh:mm:ss`. Rango: `1000-01-01 00:00:00` a `9999-12-31 23:59:59`. Puede usarse `DEFAULT CURRENT_TIMESTAMP` y `ON UPDATE CURRENT_TIMESTAMP`. |
| `TIMESTAMP(fsp)` | Marca de tiempo en formato `YYYY-MM-DD hh:mm:ss`. Se almacena como el número de segundos desde el 1 de enero de 1970 (Unix epoch). Rango: `1970-01-01 00:00:01` UTC a `2038-01-09 03:14:07` UTC. Puede actualizarse automáticamente con `CURRENT_TIMESTAMP`. |
| `TIME(fsp)`  | Hora en formato `hh:mm:ss`. Rango: `-838:59:59` a `838:59:59`. |
| `YEAR`       | Año en formato de cuatro dígitos (`1901` a `2155`). MySQL 8.0 ya no admite el formato de dos dígitos. |

### **Tipos de datos en SQL Server**

**Tipos de datos de cadena**:

| Data type         | Descripción | Longitud máxima | Almacenamiento |
|------------------|------------|----------------|---------------|
| `char(n)`       | Cadena de caracteres no Unicode de longitud fija (`n` entre 1 y 8000). | 8,000 | `n` bytes (1 byte por carácter). |
| `varchar(n)`    | Cadena de caracteres no Unicode de longitud variable (`n` entre 1 y 8000). | 8,000 | `n` bytes + 2 bytes adicionales. |
| `varchar(max)`  | Cadena de caracteres no Unicode de longitud variable. | Hasta 2 GB | Variable |
| `nchar(n)`      | Cadena de caracteres Unicode de longitud fija (`n` entre 1 y 4000). | 4,000 | `2 * n` bytes (2 bytes por carácter). |
| `nvarchar(n)`   | Cadena de caracteres Unicode de longitud variable (`n` entre 1 y 4000). | 4,000 | `2 * n` bytes + 2 bytes adicionales. |
| `nvarchar(max)` | Cadena de caracteres Unicode de longitud variable. | Hasta 2 GB | Variable |
| `binary(n)`     | Datos binarios de longitud fija (`n` entre 1 y 8000). | 8,000 | `n` bytes. |
| `varbinary(n)`  | Datos binarios de longitud variable (`n` entre 1 y 8000). | 8,000 | Longitud real de los datos + 2 bytes adicionales. |
| `varbinary(max)` | Datos binarios de longitud variable. | Hasta 2 GB | Variable |

**Tipos de datos numéricos**:

| Data type         | Descripción | Almacenamiento |
|------------------|------------|---------------|
| `bit`           | Entero que puede ser `0`, `1` o `NULL`. | 1 bit |
| `tinyint`       | Entero de 0 a 255. | 1 byte |
| `smallint`      | Entero de -32,768 a 32,767. | 2 bytes |
| `int`           | Entero de -2,147,483,648 a 2,147,483,647. | 4 bytes |
| `bigint`        | Entero de -9,223,372,036,854,775,808 a 9,223,372,036,854,775,807. | 8 bytes |
| `decimal(p,s)` / `numeric(p,s)` | Número de precisión fija (máximo `p=38`, `s=0` por defecto). | 5-17 bytes |
| `smallmoney`    | Datos monetarios de -214,748.3648 a 214,748.3647. | 4 bytes |
| `money`         | Datos monetarios de -922,337,203,685,477.5808 a 922,337,203,685,477.5807. | 8 bytes |
| `float(n)`      | Número de punto flotante (`n=24` usa 4 bytes, `n=53` usa 8 bytes). Rango: `-1.79E+308` a `1.79E+308`. | 4 u 8 bytes |
| `real`          | Número de punto flotante de menor precisión (`-3.40E+38` a `3.40E+38`). | 4 bytes |

**Tipos de datos de fecha y hora**:

| Data type         | Descripción | Almacenamiento |
|------------------|------------|---------------|
| `datetime`      | De `1753-01-01` a `9999-12-31`, con precisión de 3.33 ms. | 8 bytes |
| `datetime2`     | De `0001-01-01` a `9999-12-31`, con precisión de 100 ns. | 6-8 bytes |
| `smalldatetime` | De `1900-01-01` a `2079-06-06`, con precisión de 1 min. | 4 bytes |
| `date`         | Solo almacena fecha (`0001-01-01` a `9999-12-31`). | 3 bytes |
| `time`         | Solo almacena hora, con precisión de 100 ns. | 3-5 bytes |
| `datetimeoffset` | Igual a `datetime2`, pero con zona horaria. | 8-10 bytes |
| `timestamp`    | Guarda un número único que se actualiza cuando se modifica la fila. No representa tiempo real. | Variable |

**Otros tipos de datos**:

| Data type         | Descripción |
|------------------|------------|
| `sql_variant`   | Almacena hasta 8,000 bytes de diferentes tipos de datos (excepto `text`, `ntext` y `timestamp`). |
| `uniqueidentifier` | Almacena un identificador global único (GUID). |
| `xml`          | Almacena datos en formato XML (máximo 2 GB). |
| `cursor`       | Almacena una referencia a un cursor para operaciones en la base de datos. |
| `table`        | Almacena un conjunto de resultados para su procesamiento posterior. |

### Tipos de datos en MS Access

| Data type      | Description | Storage |
|---------------|-------------|---------|
| Text          | Use for text or combinations of text and numbers. 255 characters maximum | - |
| Memo         | Memo is used for larger amounts of text. Stores up to 65,536 characters. Note: You cannot sort a memo field. However, they are searchable | - |
| Byte         | Allows whole numbers from 0 to 255 | 1 byte |
| Integer      | Allows whole numbers between -32,768 and 32,767 | 2 bytes |
| Long         | Allows whole numbers between -2,147,483,648 and 2,147,483,647 | 4 bytes |
| Single       | Single precision floating-point. Will handle most decimals | 4 bytes |
| Double       | Double precision floating-point. Will handle most decimals | 8 bytes |
| Currency     | Use for currency. Holds up to 15 digits of whole dollars, plus 4 decimal places. Tip: You can choose which country's currency to use | 8 bytes |
| AutoNumber   | AutoNumber fields automatically give each record its own number, usually starting at 1 | 4 bytes |
| Date/Time    | Use for dates and times | 8 bytes |
| Yes/No       | A logical field can be displayed as Yes/No, True/False, or On/Off. In code, use the constants True and False (equivalent to -1 and 0). Note: Null values are not allowed in Yes/No fields | 1 bit |
| Ole Object   | Can store pictures, audio, video, or other BLOBs (Binary Large Objects) | up to 1GB |
| Hyperlink    | Contain links to other files, including web pages | - |
| Lookup Wizard | Let you type a list of options, which can then be chosen from a drop-down list | 4 bytes |

# Inyección SQL

La **inyección SQL** es una vulnerabilidad de seguridad que permite a un atacante insertar o manipular consultas SQL a través de entradas de usuario mal validadas o no filtradas. Esto puede llevar a que se acceda, modifique o elimine información sensible en la base de datos.

## ¿Cómo Funciona?

Cuando una aplicación construye una consulta SQL concatenando directamente los datos de entrada del usuario, un atacante puede inyectar código SQL malicioso. Por ejemplo, considere la siguiente consulta:

```sql
SELECT * FROM usuarios WHERE nombre = 'usuario' AND contraseña = 'contraseña';
```

Si los valores de usuario y contraseña se toman directamente de la entrada del usuario sin validar, un atacante podría introducir algo como:

- usuario: admin
- contraseña: x' OR '1'='1

La consulta resultante sería:

```sql
SELECT * FROM usuarios WHERE nombre = 'admin' AND contraseña = 'x' OR '1'='1';
```

Dado que `'1'='1'` siempre es verdadero, la consulta devolverá todos los registros de la tabla `usuarios`, lo que permitiría al atacante acceder a la cuenta de administrador.

## Ejemplo de Inyección SQL

Supongamos que en una aplicación web se construye la siguiente consulta:
```python
consulta = "SELECT * FROM usuarios WHERE nombre = '" + usuario + "' AND contraseña = '" + contraseña + "'"
```

Si un atacante introduce `x' OR '1'='1` como contraseña, la consulta resultante sería:

```sql
SELECT * FROM usuarios WHERE nombre = 'admin' AND contraseña = 'x' OR '1'='1';
```


## Cómo Prevenir la Inyección SQL

1. **Usar Consultas Preparadas**: Emplear parámetros en lugar de concatenar cadenas. Por ejemplo, usando un ORM o APIs que soporten consultas parametrizadas.
2. **Validar y Sanear la Entrada del Usuario**: Asegurarse de que los datos cumplan el formato esperado y no contengan código malicioso.
3. **Utilizar ORMs (Object-Relational Mapping)**: Herramientas como SQLAlchemy (en Python) generan consultas seguras automáticamente.
4. **Configurar Permisos Adecuados**: Limitar los privilegios de la cuenta de la base de datos para reducir el impacto en caso de un ataque.

# Cosas pseudoimportantes

# Cosas a aprender

- Como evitar inyecciones SQL